* Search for SR Radio Shows

** Description
   A RESTful API built with Java Spring Boot that enables searching for a radio show available on SR's public API.
   
   Accepts a =GET= request with search query at ={ApplicationUrl}/search?{query}= and server the user one of:
   
   #+NAME: show-found
   #+BEGIN_SRC json <header arguments>
      HttpStatus = 200
      {
         "message" : "The following show matched the search term <query>:"
         "name" : "<show name>"
         "description" : "<show> description>"
         "broadcastinfo" : "<show broadcastinfo>"
      }

   #+END_SRC
   
   #+RESULTS:
   : HttpStatus 200

   Minimal application that takes a searchword and then returns information about any show that matches the query.
   
** Run
   Utilizes SR's public API, see https://sverigesradio.se/api/documentation/v2/index.html.
   
   Lorem ipsum...

** Limitations
   Lorem ipsum...

